Revit 2027 API
BuiltInFailures.RebarFailures.RebarCannotBeDeleted Property
 You cannot delete all bars for the sets that are being edited.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarCannotBeDeleted { get; }
Public Shared ReadOnly Property RebarCannotBeDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarCannotBeDeleted {
	FailureDefinitionId^ get ();
}
static member RebarCannotBeDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace